ci4/app/Controllers/Artikel.php

    public function admin_index()
    {
        $model = new ArtikelModel();

        // Ambil data pencarian dan filter dari URL
        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';

        // 1. Ambil object Query Builder bawaan dari model artikel
        $builder = $model->builder();

        // 2. Tentukan kolom yang di-select dan lakukan Join tabel kategori
        $builder->select('artikel.*, kategori.nama_kategori');
        $builder->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left');

        // 3. Filter Pencarian Judul (Jika ada input cari)
        if (!empty($q)) {
            $builder->like('artikel.judul', $q);
        }

        // 4. Filter Kategori (Jika kategori dipilih)
        if (!empty($kategori_id)) {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        // 5. Urutkan berdasarkan ID terbesar (Artikel terbaru di paling atas)
        $builder->orderBy('artikel.id', 'DESC');

        // 6. Eksekusi Paginasi langsung menggunakan data builder (Cara paling aman CI4)
        $data['artikel'] = $model->paginate(10, 'default');
---
SELECT *
FROM `artikel`


        // Ambil data kategori untuk isi Dropdown Filter Pencarian
        $kategoriModel = new KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function add()
    {
        $kategoriModel = new KategoriModel();
        $model = new ArtikelModel();

        if ($this->request->is('post') && $this->validate([
            'judul' => 'required',
            'id_kategori' => 'required|integer'
        ])) {
            $model->insert([
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'slug' => url_title($this->request->getPost('judul'), '-', true),
                'id_kategori' => $this->request->getPost('id_kategori'),
                'status' => 1 // Default aktif
            ]);

            return redirect()->to(route_to('admin_artikel'));
        }

        $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function edit($id)
    {
        $model = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        if ($this->request->is('post') && $this->validate([
            'judul' => 'required',
            'id_kategori' => 'required|integer'
        ])) {
            $model->update($id, [
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'slug' => url_title($this->request->getPost('judul'), '-', true),
                'id_kategori' => $this->request->getPost('id_kategori')
            ]);

            return redirect()->to(route_to('admin_artikel'));
        }

        $data['artikel'] = $model->find($id);
        $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '1'
SELECT *
FROM `kategori`