ci4/app/Controllers/Artikel.php

public function delete($id)
{
$artikel = new ArtikelModel();
$artikel->delete($id);
---
DELETE FROM `artikel`
WHERE `id` IN ('3')