ci4/app/Controllers/Artikel.php

    public function delete($id)
    {
        $model = new ArtikelModel();
        $model->delete($id);
---
DELETE FROM `artikel`
WHERE `id` IN ('15')