ci4/app/Controllers/Post.php

    public function index()
    {
        $model = new ArtikelModel();
        $data['artikel'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `id` DESC

    public function create()
    {
        $model = new ArtikelModel();
        $data = [
            'judul' => $this->request->getVar('judul'),
            'isi' => $this->request->getVar('isi'),
        ];
        $model->insert($data);
---
INSERT INTO `artikel` (`judul`, `isi`) VALUES ('artikel 22', 'ndaljhdauknd')

    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->first();
        if ($data) {
            $model->delete($id);
---
SELECT *
FROM `artikel`
WHERE `id` = '2'
 LIMIT 1
DELETE FROM `artikel`
WHERE `id` IN ('2')